### Task 1: Pandas

In [13]:
import pandas as pd
import numpy as np

#### 1. Import the dataframe

In [14]:
df = pd.read_csv('messy_data.csv')
df.head(10)

    ID     Name    Age     Date Joined  Score Department
0  1.0    Alice   TRUE      2021-01-15   88.5      Sales
1  2.0     Bob   FALSE      15/02/2021   92.0      sales
2  2.0  Charlie     40      2021-03-05    NaN         HR
3  NaN     Dave     35  April 10, 2021   85.0        HR
4  5.0      NaN    NaN      2021.05.01   90.0    finance
5  6.0      Eve     28      2021-06-01    NaN    Finance

#### 2. Find data types of the columns using inbuilt function

In [15]:
df.dtypes

ID             float64
Name            object
Age             object
Date Joined     object
Score          float64
Department      object
dtype: object

#### 3. List all the unique values in the “Department” column and clean the mistake

In [16]:
ndf = df['Department'].astype(str).str.lower().str.strip()
print(ndf.unique())
df

['sales' 'hr' 'finance']

    ID     Name    Age     Date Joined  Score Department
0  1.0    Alice   TRUE      2021-01-15   88.5      Sales
1  2.0     Bob   FALSE      15/02/2021   92.0      sales
2  2.0  Charlie     40      2021-03-05    NaN         HR
3  NaN     Dave     35  April 10, 2021   85.0        HR
4  5.0      NaN    NaN      2021.05.01   90.0    finance
5  6.0      Eve     28      2021-06-01    NaN    Finance

#### 4. Drop missing data/NA data from the column 'Score'

In [17]:
df.dropna(subset=['Score'], inplace=True)
df

    ID    Name    Age     Date Joined  Score Department
0  1.0   Alice   TRUE      2021-01-15   88.5      Sales
1  2.0    Bob   FALSE      15/02/2021   92.0      sales
3  NaN    Dave     35  April 10, 2021   85.0        HR
4  5.0     NaN    NaN      2021.05.01   90.0    finance

#### 5. Rename columns “Date Joined” → “JoinedDate” and “Score” → “PerformanceScore”

In [18]:
df = df.rename(columns = {'Date Joined' : 'JoinedDate', 'Score' : 'PerformanceScore' })
# df.rename(columns = {'Date Joined' : 'JoinedDate', 'Score' : 'PerformanceScore' }, inplace = True)
df

    ID    Name    Age      JoinedDate  PerformanceScore Department
0  1.0   Alice   TRUE      2021-01-15              88.5      Sales
1  2.0    Bob   FALSE      15/02/2021              92.0      sales
3  NaN    Dave     35  April 10, 2021              85.0        HR
4  5.0     NaN    NaN      2021.05.01              90.0    finance

#### 6.  Drop duplicate rows based on the “ID” column, keeping only the first occurrence

In [19]:
df = df.drop_duplicates(subset='ID')
df

    ID    Name    Age      JoinedDate  PerformanceScore Department
0  1.0   Alice   TRUE      2021-01-15              88.5      Sales
1  2.0    Bob   FALSE      15/02/2021              92.0      sales
3  NaN    Dave     35  April 10, 2021              85.0        HR
4  5.0     NaN    NaN      2021.05.01              90.0    finance

#### 7. 'Departments' may have extra spaces or inconsistent casing, strip whitespace and capitalize each department name

In [20]:
df['Department'] = df['Department'].replace({
    'sales' : "Sales",
    'hr' : 'HR',
    'finance' : 'Finance'
})
df

    ID    Name    Age      JoinedDate  PerformanceScore Department
0  1.0   Alice   TRUE      2021-01-15              88.5      Sales
1  2.0    Bob   FALSE      15/02/2021              92.0      Sales
3  NaN    Dave     35  April 10, 2021              85.0        HR
4  5.0     NaN    NaN      2021.05.01              90.0    Finance

#### 8. Save the new dataframe to csv

In [21]:
# df.to_csv("cleaned_data.csv")